# NUMBER 2

In [11]:
odd_columns = cars.iloc[:, 1::2]

result = odd_columns.head()
result

    mpg   disp  drat   qsec  am  carb
0  21.0  160.0  3.90  16.46   1     4
1  21.0  160.0  3.90  17.02   1     4
2  22.8  108.0  3.85  18.61   1     1
3  21.4  258.0  3.08  19.44   0     1
4  18.7  360.0  3.15  17.02   0     2

In [12]:
cars[0:1]

       Model   mpg  cyl   disp   hp  drat    wt   qsec  vs  am  gear  carb
0  Mazda RX4  21.0    6  160.0  110   3.9  2.62  16.46   0   1     4     4

In [13]:
cars.loc[cars['Model']=='Camaro Z28', ['Model', 'cyl']]

         Model  cyl
23  Camaro Z28    8

In [14]:
cars.loc[[1,28,18],['Model', 'cyl', 'gear']]

             Model  cyl  gear
1    Mazda RX4 Wag    6     4
28  Ford Pantera L    8     5
18     Honda Civic    4     4